import './news.scss';
import React from 'react';
import { Container, Grid, Image, Modal } from 'semantic-ui-react';
import { NavLink } from 'react-router-dom';
import ReactPlayer from 'react-player';

export const News3 = () => (
  <div className="news-page" style={{ marginTop: '12vh' }}>
    <Container>
      <Grid centered stackable>
        <Grid.Row>
          <Image src="content/images/project-team/group photo_youwho.jpg" size="huge" />
        </Grid.Row>
        <Grid.Row>
          <h1 className="news-page-h1">ADVERTORIAL</h1>
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            Η έρευνα «<NavLink to="/">YouWho?</NavLink>», η οποία υλοποιείται από το Εθνικό Κέντρο Κοινωνικών Ερευνών (το μοναδικό
            ερευνητικό κέντρο δημοσίου δικαίου για τις κοινωνικές επιστήμες στην Ελλάδα) έχει ως αντικείμενό της τη νέα γενιά. Στοχεύει στη
            διερεύνηση των χαρακτηριστικών των νέων που γεννήθηκαν μεταξύ των ετών 1991-2003 και συνεπώς βρίσκονται στο ηλικιακό εύρος των
            17-29 ετών.
          </p>
          <p className="news-page-p">
            Με έναν ανατρεπτικό τρόπο, που θα ανακαλύψει ο ενδιαφερόμενος μέσα από τη συμμετοχή του στην έρευνα, θα γνωρίσει τις αξίες, τις
            πολιτικές τοποθετήσεις, τις ιδεολογικές ταυτίσεις, το πώς ορίζει την έννοια του καλού πολίτη, τον τρόπο ζωής και πολλές ακόμη
            πτυχές του εαυτού του. Πηγή: www.lifo.gr
          </p>
        </Grid.Row>
        <Grid.Row columns={2}>
          <Grid.Column>
            <p className="news-page-p">
              <span className="bold">
                Οι νέοι δεν είναι ούτε η «λύση» ούτε η «αιτία» του προβλήματος, όπου πρόβλημα μπορεί να είναι το καθετί που ορίζεται κάθε
                φορά ως τέτοιο από τον δημόσιο λόγο
              </span>
            </p>
          </Grid.Column>
        </Grid.Row>
        <Grid.Row>
          <Image src="content/images/tmp-news/YouWho-Gramma.jpg" size="huge" />
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            Η έρευνα είναι πανελλαδική. Εστιάζει σε θέματα που αφορούν τη σχέση των νέων με την πολιτική, τον τρόπο με τον οποίο
            αντιλαμβάνονται την έννοια του έθνους, τις καθημερινές τους συνήθειες (lifestyle), τις πολιτισμικές τους πρακτικές, αλλά και την
            προσωπικότητά τους.
          </p>
          <p className="news-page-p">
            Ολοκληρώνοντας την έρευνα, εκτός του ότι θα λάβεις μια σκιαγράφηση του εαυτού σου, θα δεις και πού βρίσκεσαι στον «χάρτη» της
            γενιάς που ανήκεις και θα μπορέσεις να συγκρίνεις το προφίλ σου σε σχέση με εκατοντάδες άλλους συνομίληκούς σου που έχουν λάβει
            ήδη μέρος.
          </p>
          <p className="news-page-p">
            Παράλληλα, ο τρόπος που σχεδιάστηκε το «YouWho?» είναι διαδραστικός και σίγουρα θα σε κάνει να χαμογελάσεις λίγο παραπάνω.
          </p>
        </Grid.Row>
        <Grid.Row>
          <Image src="content/images/tmp-news/YouWho-results.jpg" size="large" />
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            Η LiFO συνομίλησε με τις επιστημονικές συνυπεύθυνες της έρευνας και ερευνήτριες του ΕΚΚΕ, Μανίνα Κακεπάκη, Δρ. πολιτικής
            επιστήμης, και Κατερίνα Ηλιού, Δρ. κοινωνικής ψυχολογίας, οι οποίες εξηγούν γιατί αξίζει ένας νέος 17 – 29 ετών να συμμετάσχει.
          </p>
          <p className="news-page-p">
            <span className="bold">
              --Ποιος είναι ο στόχος αυτής της έρευνας και γιατί θεωρείτε ότι είναι τόσο σημαντική για την κοινωνία σήμερα;
            </span>
            <br />Ο στόχος της έρευνας είναι ταυτόχρονα απλός και σύνθετος, θα λέγαμε. Θέλουμε να μελετήσουμε τις πολλαπλές ταυτότητες των
            νέων στην Ελλάδα σήμερα, καθώς διαπιστώνουμε ότι ενώ μιλάμε για τους νέους, οι νέοι ως κοινωνική κατηγορία δεν έχουν μελετηθεί
            επαρκώς. Παράλληλα, πολλές φορές στην κοινωνική έρευνα υπάρχει μια (δικαιολογημένη) τάση να επαναλαμβάνουμε ορισμένα ερωτήματα.
          </p>
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            Για παράδειγμα, υπάρχει μια στερεοτυπική αντίληψη ότι οι νέοι δεν ενδιαφέρονται για την πολιτική, όχι μόνο στην Ελλάδα, αλλά και
            διεθνώς. Διαθέσιμα στοιχεία και έρευνες δεν επιβεβαιώνουν απόλυτα αυτή την αντίληψη. Απλά οι νέοι δεν ενδιαφέρονται για την
            πολιτική, όπως την εννοούμε και τη μετράμε συνήθως. Δηλαδή εμπλέκονται πολύ λιγότερο με αυτό που στην πολιτική επιστήμη συνήθως
            ονομάζουμε «παραδοσιακή» ή «επίσημη» πολιτική, όπως είναι η συμμετοχή σε πολιτικά κόμματα και συνδικαλιστικές οργανώσεις.
            Αντίθετα, γνωρίζουμε ότι σήμερα αντιλαμβάνονται την πολιτική περισσότερο ως μια ατομική διαδικασία η οποία μπορεί να συνδέεται
            με ατομικές επιλογές διατροφής, κατανάλωσης κ.ο.κ.
          </p>
          <p className="news-page-p">
            Άρα, προτού αποφανθούμε ότι οι νέοι αδιαφορούν για κάτι πρέπει να προβληματιστούμε μήπως δεν θέτουμε τα κατάλληλα ερωτήματα,
            γιατί πολύ απλά αυτά που ρωτάμε αντανακλούν τις ερευνητικές κατευθύνσεις προηγούμενων δεκαετιών. Φυσικά ούτε εμείς εφηύραμε τον
            τροχό, καθώς βασιζόμαστε στη διεθνή βιβλιογραφία, προσπαθούμε όμως να προβληματιστούμε πάνω σε νέα ερωτήματα, που αφορούν
            –ενδεικτικά– ζητήματα όπως οι διατροφικές συνήθειες, η άθληση, οι μορφές ψυχαγωγίας και το πώς και εάν συνδέονται με πολιτικές
            και κοινωνικές ταυτότητες. Αυτό είναι κάτι αρκετά διαφορετικό.
          </p>
          <p className="news-page-p">
            Και σίγουρα, πολύ διαφορετικό είναι το ύφος και ο σχεδιασμός της έρευνας. Εδώ μπορούμε με ασφάλεια να πούμε ότι καινοτομούμε,
            καθώς εισάγουμε ίσως για πρώτη φορά την έννοια της «εμπειρίας» στην κοινωνική έρευνα!
          </p>
          <p className="news-page-p">
            Η έρευνά μας, λοιπόν, είναι σημαντική καθώς επιχειρούμε να αναδείξουμε μέσα από τεκμηριωμένα δεδομένα ψηφίδες της ταυτότητας των
            νέων μέσα από σύγχρονα ερευνητικά ερωτήματα. Εξίσου σημαντική θεωρούμε ότι είναι και η απόπειρά μας να συλλέξουμε δεδομένα με
            έναν τρόπο που πρώτη φορά εφαρμόζεται στις κοινωνικές επιστήμες στη χώρα μας, διαμορφώνοντας ένα ερωτηματολόγιο σε μορφή chat
            bot.
          </p>
        </Grid.Row>
        <Grid.Row>
          <Image src="content/images/tmp-news/YouWho-highlight-1.jpg" size="large" />
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            Τέλος, επιδιώκοντας να συμβάλλουμε σε έναν εμπεριστατωμένο διάλογο για του νέους σήμερα, τα ερευνητικά μας αποτελέσματα θα είναι
            ελεύθερα προσβάσιμα για κάθε ενδιαφερόμενο στις δύο ψηφιακές πλατφόρμες του Εθνικού Κέντρου Κοινωνικών Ερευνών:
            <br />
            <br />
            <NavLink to="/">YouWho.gr</NavLink>
            <br />
            <br />
            <a href="https://socioscope.gr" target="_blank">
              Socioscope.gr
            </a>
          </p>
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            <span className="bold">--Γιατί να συμμετάσχει ένας νέος σε αυτή την έρευνα;</span>
            <br />
            Για τρεις λόγους: 1) Θα δει κάτι νέο και ενδιαφέρον, 2) θα πάρει απαντήσεις για τον εαυτό του, 3) θα συμβάλει στην αποτύπωση του
            προφίλ της γενιάς του/της.
          </p>
          <p className="news-page-p">
            Αυτή η ερώτηση μας προβλημάτισε ιδιαίτερα και εμάς. Ένα από τα σοβαρότερα μεθοδολογικά ζητήματα που αντιμετωπίζουν όλες οι
            έρευνες, ανεξάρτητα από τον τρόπο συλλογής των δεδομένων, είναι η άρνηση να συμμετάσχει κανείς σε αυτές. Πώς επιλύεται συνήθως;
            Πολύ σχηματικά με δυο τρόπους: με χρηματικά κίνητρα (πληρώνοντας τους συμμετέχοντες/-ουσες) και με εκ των υστέρων διορθώσεις στο
            δείγμα.
          </p>
          <p className="news-page-p">
            Εμείς θελήσαμε να πειραματιστούμε με κάτι εντελώς διαφορετικό, ακριβώς επειδή στοχεύουμε στη συγκεκριμένη ηλικιακή κατηγορία.
            Πραγματοποιήσαμε ομαδικές συζητήσεις με νέους και προβληματιστήκαμε από τις απαντήσεις τους για θέματα, όπως αν θα συμμετείχαν
            στη συμπλήρωση ενός ερωτηματολογίου ακαδημαϊκού φορέα, πόση ώρα μπορεί να αφιέρωναν σε αυτό, τι θα αποτελούσε κίνητρο για τη
            συμμετοχή τους, ποια θέματα θα κρατούσαν το ενδιαφέρον τους, τι θα τους προέτρεπε να προτείνουν και σε άλλους να συμμετέχουν.
          </p>
          <p className="news-page-p">
            Έτσι, αποφασίσαμε να δημιουργήσουμε ένα καινοτόμο ερωτηματολόγιο που η συμπλήρωσή του θα μπορεί να προσφέρει ικανοποίηση και να
            κρατάει το ενδιαφέρον των νέων τόσο μέσα από το περιεχόμενό του, όσο και λόγω του σχεδιασμού του. Είναι μια επιστημονική έρευνα,
            στη οποία όμως χωράει η Ελένη Φουρέιρα, τα talent shows, το αρνί του Πάσχα, με τρόπους και μορφή που σίγουρα δεν έχουμε
            συναντήσει.
          </p>
          <p className="news-page-p">
            Επίσης, δίνουμε το κίνητρο της άμεσης παρουσίασης ενός ατομικού, αλλά και συγκριτικού προφίλ. Με την ολοκλήρωση του
            ερωτηματολογίου μπορεί κανείς να δει βασικά χαρακτηριστικά του προφίλ του (βάσει των απαντήσεων που έδωσε σε κάποιες ερωτήσεις),
            αλλά και ποιο είναι το αντίστοιχο προφίλ όσων ήδη συμπλήρωσαν το ερωτηματολόγιο. Θέλουμε να πούμε σε όσους και όσες θα το
            συμπληρώσουν ότι συμμετέχουν στην αποτύπωση του προφίλ μιας γενιάς, επομένως είναι σημαντικό να έχουμε απαντήσεις από όσο
            γίνεται περισσότερους πολιτικούς, κοινωνικούς, γεωγραφικούς χώρους. Ας μην μιλάνε συνέχεια κάποιοι στο όνομα των υπολοίπων...
          </p>
        </Grid.Row>
        <Grid.Row>
          <Image src="content/images/tmp-news/YouWho-highlight-2.jpg" size="large" />
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            <span className="bold">--Ποιες είναι οι θεματικές που προσεγγίζει και γιατί;</span>
            <br />
            Μελετάμε τη σχέση των νέων με την πολιτική, το πώς διαμορφώνεται η εθνική τους ταυτότητα, την προσωπικότητά και τις
            διαπροσωπικές τους σχέσεις, ζητήματα αξιών, καθημερινές συνήθειες και πρακτικές. Είναι αρκετά, αλλά είναι και άλλα τόσα αυτά που
            αναγκαστικά αφήσαμε απ' έξω, γιατί διαφορετικά θα χρειαζόταν πάνω από μια ώρα να το συμπληρώσει κανείς. Από την πλευρά μας
            εργαστήκαμε με στόχο ο χρόνος συμπλήρωσης να είναι περίπου 10-15' και μας εκπλήσσει ευχάριστα ότι πολλοί νέοι και νέες μας λένε
            πως απόλαυσαν ιδιαίτερα τη διαδικασία.
          </p>
          <p className="news-page-p">
            <span className="bold">--Η προσωπική σας άποψη για τους νέους σήμερα ποια είναι;</span>
            <br />
            Οι νέοι δεν είναι μια ενιαία και αδιαίρετη κοινωνική κατηγορία, συνεπώς ό,τι πούμε θα έχει στοιχεία γενίκευσης. Η επιστημονική
            μας θέση και στάση στη συγκεκριμένη έρευνα είναι να μην προσεγγίζουμε τους νέους ούτε με αρνητικά αλλά ούτε και με θετικά
            στερεότυπα. Τι εννοούμε με αυτό; Οι νέοι δεν είναι ούτε η «λύση» ούτε η «αιτία» του προβλήματος, όπου πρόβλημα μπορεί να είναι
            το καθετί που ορίζεται κάθε φορά ως τέτοιο από τον δημόσιο λόγο.
          </p>
          <p className="news-page-p">
            Ωστόσο, σίγουρα πιστεύουμε ότι οι νέοι σήμερα μοιράζονται ορισμένα κοινά χαρακτηριστικά που βασίζονται στις
            κοινωνικό-δημογραφικές μεταβολές του 21ου αιώνα, που τους διαφοροποιούν από τους νέους παλαιότερων γενεών, και τα οποία με τον
            έναν ή τον άλλο τρόπο συνδέονται και με το περιεχόμενο της έρευνάς μας. Ποια είναι αυτά;
          </p>
          <p className="news-page-p">
            α) Μικρότερη –αναλογικά– συμμετοχή τους στο εκλογικό σώμα, συνέπεια αφενός της γήρανσης του πληθυσμού και αφετέρου του γεγονότος
            ότι οι μεγαλύτερες ηλικίες ψηφίζουν σε υψηλότερα ποσοστά. Αυτό μας ενδιαφέρει ιδιαίτερα γιατί έχει συνέπειες και στη μελέτη της
            πολιτικής τους συμπεριφοράς και των πολιτικών τους πρακτικών. β) Το γεγονός ότι καθυστερούν, σε σχέση με παλαιότερες γενιές, να
            φτάσουν ορισμένα milestones που σχετίζονται με την ενηλικίωση (σπίτι, γάμος, οικογένεια, σταθερή απασχόληση κ.ο.κ.) και τα οποία
            με τη σειρά τους ξέρουμε ότι συνδέονται και με την πολιτική συμμετοχή. γ) Βιώνουν σαρωτικές μεταβολές στο καθεστώς απασχόλησης
            (η γενιά με τα υψηλότερα τυπικά προσόντα και τα υψηλότερα ποσοστά ανεργίας/επισφαλούς εργασίας), χωρίς όμως να έχουν βιώσει
            εποχές «ευμάρειας». Είναι η γενιά που, όπως λέμε, βιώνει την κρίση ως κανονικότητα και όχι ως ανατροπή υφιστάμενων εργασιακών ή
            άλλων σχέσεων. δ) Μια άλλη σχέση με την τεχνολογία και τα social media. Λίγο σχηματικά, αν εμείς, που είμαστε μεταξύ 40 και 50
            ετών, είμαστε οι digital immigrants, εκείνοι είναι digital natives, δηλαδή συμβιώνουν από τη γέννησή τους με μορφές επικοινωνίας
            και την εντάσσουν πλήρως στη ζωή τους και στον τρόπο που αντιλαμβάνονται τον εαυτό τους.
          </p>
        </Grid.Row>
        <Grid.Row>
          <Image src="content/images/tmp-news/YouWho-highlight-3.jpg" size="large" />
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            Τέλος, μέσα από την έρευνά μας επιδιώκουμε να δούμε το συνθετικό προφίλ των νέων. Μάλιστα, θα επιχειρήσουμε να διατυπώσουμε τα
            ερευνητικά μας συμπεράσματα όχι με όρους κυρίαρχων τάσεων στις απαντήσεις τους, και άρα να εντοπίσουμε τα κυρίαρχα
            χαρακτηριστικά τους, αλλά με όρους συμπερίληψης. Δηλαδή, για ορισμένα χαρακτηριστικά, θα δούμε κατά πόσο τα ίδια άτομα φέρουν
            και το αντίθετο χαρακτηριστικό.
          </p>
          <p className="news-page-p">
            Π.χ. ένα άτομο μπορεί να εμφανίζεται κατά κύριο λόγο δραστήριος/-α, σύμφωνα με τις απαντήσεις του/της, αλλά δεν παύει να είναι
            σε κάποιες πτυχές της έρευνας αδρανής. Μας ενδιαφέρει να μελετήσουμε τι είναι αυτό που «κάνει κάποιον/-α» δραστήριο/-α σε
            κάποιες περιπτώσεις και αδρανή σε κάποιες άλλες».
          </p>
          <p className="news-page-p">
            Σε κάθε περίπτωση στόχος μας είναι να εμπνεύσουμε τους νέους να μιλήσουν οι ίδιοι για τον εαυτό τους και ταυτόχρονα να γνωρίσουν
            λίγο καλύτερα τον εαυτό τους.
          </p>
          <p className="news-page-p">
            Λάβετε μέρος στην έρευνα στο: <NavLink to="/">YouWho.gr</NavLink>
          </p>
        </Grid.Row>
        <Grid.Row>
          <ReactPlayer url="https://www.youtube.com/watch?v=AhveenOl5K8&feature=emb_title" />
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            Πηγή:{' '}
            <a href="https://www.lifo.gr/" target="_blank">
              www.lifo.gr
            </a>
          </p>
        </Grid.Row>
      </Grid>
    </Container>
  </div>
);

export default News3;
