import './news.scss';
import React from 'react';
import { Container, Grid, Image, Menu } from 'semantic-ui-react';
import ReactPlayer from 'react-player';
import { NavLink } from 'react-router-dom';

const News2 = () => (
  <div className="news-page" style={{ marginTop: '12vh' }}>
    <Container>
      <Grid centered stackable>
        <Grid.Row>
          <h1 className="news-page-h1">«Εσύ πόσο YouWho είσαι;»: Έρευνα για την ταυτότητα των νέων στην Ελλάδα του 21ου αιώνα</h1>
          <p className="news-page-p">
            Είσαι 17-29 ετών; Θέλεις να δεις πού βρίσκεσαι στον… «χάρτη» της γενιάς σου; Κάνε chat με τη Γιαγιά και μάθε πόσο YouWho είσαι!
            Με αυτό το πρωτότυπο κάλεσμα, το
            <a href="https://www.ekke.gr/" target="_blank">
              {' '}
              Εθνικό Κέντρο Κοινωνικών Ερευνών
            </a>{' '}
            προτρέπει τους νέους να συμμετέχουν σε μια νέα διαδικτυακή έρευνα που επιχειρεί να δώσει απαντήσεις σχετικά με το πολυδιάστατο
            προφίλ της σημερινής νεολαίας, βοηθώντας παράλληλα τους ίδιους τους συμμετέχοντες να γνωρίσουν καλύτερα τον εαυτό τους.
          </p>
        </Grid.Row>
        <Grid.Row>
          <ReactPlayer url="https://www.youtube.com/watch?v=AhveenOl5K8&feature=emb_title" />
        </Grid.Row>
        <Grid.Row>
          <h1 className="news-page-h1">Στόχος της έρευνας</h1>
          <p className="news-page-p">
            «Στόχος της έρευνας είναι να μελετήσει διεπιστημονικά και με καινοτόμες μεθοδολογικές προσεγγίσεις την ταυτότητα των νέων στην
            Ελλάδα του 21ου αιώνα εστιάζοντας στη σχέση τους με την πολιτική, τον τρόπο πρόσληψης του έθνους, τις καθημερινές τους συνήθειες
            (lifestyle), τις πολιτισμικές τους πρακτικές, αλλά και την προσωπικότητά τους. Η συλλογή των δεδομένων γίνεται μέσα από μία
            μοντέρνα πλατφόρμα συμπλήρωσης online ερωτηματολογίου», εξηγούν στο ert.gr η διδάκτορας Κοινωνικής Ψυχολογίας
            <span className="bold">Κατερίνα Ηλιού</span> και η διδάκτορας Πολιτικής Επιστήμης <span className="bold">Μανίνα Κακεπάκη</span>,
            εντεταλμένες ερευνήτριες στο ΕΚΚΕ, συνυπεύθυνες της έρευνας <NavLink to="/">YouWho?</NavLink>.
          </p>
        </Grid.Row>
        <Grid.Row columns={2}>
          <Grid.Column>
            <Image />
          </Grid.Column>
          <Grid.Column>
            <p className="news-page-p">
              Με τη συνδρομή εξειδικευμένου προσωπικού από διάφορα πεδία (Κοινωνιολογία, Επικοινωνία, Στατιστική, Μηχανική Υπολογιστών) αλλά
              και με τη βοήθεια φοιτητών και φοιτητριών που ολοκλήρωσαν την πρακτική τους άσκηση στο ΕΚΚΕ, οι ερευνητές επιδιώκουν όχι μόνο
              να αναπτύξουν έναν δημόσιο διάλογο που αφορά τα βασικά χαρακτηριστικά της νέας γενιάς, αλλά και να αναδείξουν όλους εκείνους
              τους παράγοντες που συνθέτουν την πολυμορφική εικόνα των νέων, πάντα σε συνάρτηση με όσα συμβαίνουν τόσο στην Ελλάδα όσο και
              σε ολόκληρο τον κόσμο.
            </p>
          </Grid.Column>
        </Grid.Row>
        <Grid.Row>
          <h1 className="news-page-h1">Το στοιχείο της έκπληξης</h1>
          <p className="news-page-p">
            Προκειμένου να απαντήσουν στις διαδικτυακές ερωτήσεις, οι συμμετέχοντες στην έρευνα χρειάζεται να αφιερώσουν περίπου 10-15 λεπτά
            από τον χρόνο τους. Το ενδιαφέρον είναι πως το στοιχείο της έκπληξης κυριαρχεί σε όλη τη διαδικασία.
          </p>
          <p className="news-page-p">
            «Όποιος/α επισκέπτεται το <NavLink to="/">YouWho?</NavLink> ξαφνιάζεται ευχάριστα καθώς εισέρχεται σε ένα περιβάλλον chat όπου
            μια γνώριμη και αγαπητή στις ζωές των περισσότερων από εμάς φιγούρα περιμένει να τον υποδεχθεί. Πρόκειται για μια γιαγιά η οποία
            ζητά από τους νέους να τη βοηθήσουν ώστε να τους κατανοήσει καλύτερα», αναφέρουν χαρακτηριστικά οι συναρμόδιες για την έρευνα
            και προσθέτουν: «Καθώς βασικό χαρακτηριστικό του νεανικού πληθυσμού είναι η επικοινωνία μέσω εφαρμογών-εργαλείων κοινωνικής
            δικτύωσης, προσανατολιστήκαμε και εμείς στην υιοθέτηση αυτών των μορφών. Είναι η πρώτη φορά που λέμε στα παιδιά “ανοίξτε τα
            κινητά” σας, όχι “κλείστε τα!”».
          </p>
        </Grid.Row>
        <h1 className="news-page-h1">Ανταπόκριση και αποτελέσματα</h1>
        <Grid.Row columns={2}>
          <Grid.Column>
            <Image />
          </Grid.Column>
          <Grid.Column>
            <p className="news-page-p">
              Οι κυρίες Ηλιού και Κακεπάκη σημειώνουν πως η ανταπόκριση των νέων στο όλο εγχείρημα είναι ιδιαίτερα θετική. Αναφέρονται
              μάλιστα σε ένα συγκεκριμένο περιστατικό που επιβεβαιώνει τις εκτιμήσεις τους: «Μία καθηγήτρια Κοινωνιολογίας της Γ’ Λυκείου
              επικοινώνησε μαζί μας ενθουσιασμένη, καθώς οι μαθητές της συμπλήρωσαν το ερωτηματολόγιο στην τάξη και με αφορμή αυτό έκαναν
              μια συζήτηση για την κοινωνική έρευνα».
            </p>
          </Grid.Column>
        </Grid.Row>
        <Grid.Row>
          <p className="news-page-p">
            Οι ειδικοί, εφαρμόζοντας ποιοτικούς ελέγχους και στατιστικά κριτήρια, εξασφαλίζουν ότι στο τελικό συμπέρασμα εκπροσωπούνται
            απόψεις ατόμων με ποικίλα χαρακτηριστικά (π.χ. περιοχή κατοικίας, κοινωνικο-οικονομικό επίπεδο κ.λπ.) και επομένως επιτυγχάνεται
            μια πιο αντικειμενική παρουσίαση-«γνωριμία» με την πληθυσμιακή ομάδα που μελετάται.
          </p>
          <p className="news-page-p">
            Ωστόσο, όπως επισημαίνουν οι αρμόδιες, «είναι νωρίς ακόμα για να έχουμε μια πλήρη εικόνα. Ό,τι πούμε είναι ακόμα προσωρινό και
            πιθανά δεν θα αντιστοιχεί στα τελικά αποτελέσματα της έρευνας. Καθ’ όλη τη διάρκειά της θα ανεβάζουμε στη σελίδα του Facebook
            προσωρινά αποτελέσματα για μερικές απαντήσεις, που θα αποτυπώνουν τις τρέχουσες τάσεις στις απαντήσεις».
          </p>
          <p className="news-page-p">
            Όσοι συμμετέχουν στη διαδικτυακή έρευνα μπορούν να αντλήσουν συμπεράσματα για τον εαυτό τους (π.χ. πόσο προοδευτικοί είναι σε
            σχέση με τις πεποιθήσεις τους, πόσο δραστήριοι, πόσο κοσμοπολίτες είναι) σχηματίζοντας έτσι μια «εικόνα» για το προφίλ τους, σε
            σχέση και με τις απαντήσεις των υπόλοιπων συμμετεχόντων.
          </p>
        </Grid.Row>
        <h1 className="news-page-h1">Αξιοποίηση της έρευνας</h1>
        <Grid.Row columns={2}>
          <Grid.Column>
            <Image />
          </Grid.Column>
          <Grid.Column>
            <p className="news-page-p">
              Έπειτα από τα πρώτα περιγραφικά αποτελέσματα, που θα αναρτηθούν και στην ιστοσελίδα του έργου, και «μετά από μια μεγαλύτερη
              στατιστική επεξεργασία των δεδομένων, θα γίνει μια προσπάθεια να αποτυπωθούν ιδιαίτεροι υπο-τύποι νέων ανάλογα με τις
              απαντήσεις», εξηγούν οι κυρίες <span className="bold">Κακεπάκη</span>
              και <span className="bold">Ηλιού</span>. «Αυτό που επιθυμούμε είναι να αποφύγουμε την τακτική της στερεοτυπικής ανάδυσης
              κυρίαρχων χαρακτηριστικών και να επικεντρωθούμε στην ανάδειξη όλων των επιμέρους παραγόντων που συνθέτουν μια πολυμορφική
              εικόνα των νέων σήμερα» συμπληρώνουν. Τα ερευνητικά δεδομένα θα μπορούσαν να χρησιμοποιηθούν και για τη βελτίωση της
              καθημερινότητάς τους, υποστηρίζουν οι επιστήμονες: «Καθώς πρόκειται για μια αχαρτογράφητη γενιά που μεγάλωσε μέσα στην κρίση
              και βίωσε αυτή τη συνθήκη ως κανονικότητα, η αποτύπωση του προφίλ των νέων θα μπορούσε δυνητικά να συμβάλει στο έργο χάραξης
              πολιτικών στήριξης και εκπαιδευτικών πολιτικών για τους νέους στη χώρα μας από τους αντίστοιχους θεσμικούς φορείς (υπουργεία,
              τοπική αυτοδιοίκηση, εκπαιδευτικοί φορείς κ.λπ.)».
            </p>
          </Grid.Column>
        </Grid.Row>
        <Grid.Row columns={2}>
          <Grid.Column>
            <p className="news-page-p">
              Όπως επισημαίνουν μεταξύ άλλων οι ερευνητές, θα μπορούσε επίσης να συμβάλει στην καλλιέργεια του ευρύτερου κοινού, αλλά και
              των ίδιων των νέων, ως προς την ανάγνωση τεκμηριωμένων δεδομένων που τους αφορούν. Σε αυτό άλλωστε βοηθά και η ανάπτυξη ενός
              διαλόγου για τους νέους με βάση τα διαθέσιμα ερευνητικά δεδομένα. Επιπλέον, όπως εκτιμούν οι συνυπεύθυνες της έρευνας, το
              συγκεκριμένο έργο θα μπορούσε να συμβάλει και στην επιμόρφωση φοιτητών των κοινωνικών επιστημών ως προς την εξοικείωσή τους με
              καινοτόμες μορφές διεξαγωγής της κοινωνικής έρευνας μέσα από εισηγήσεις σε πανεπιστήμια, αλλά και μέσα από τις πλατφόρμες του
              ΕΚΚΕ (<NavLink to="/">YouWho.gr</NavLink> και{' '}
              <a href="https://socioscope.gr" target="_blank">
                Socioscope.gr
              </a>
              ).
            </p>
          </Grid.Column>
          <Grid.Column>
            <Image />
          </Grid.Column>
        </Grid.Row>
        <Grid.Row>
          <h1 className="news-page-h1">Η καινοτομία του έργου</h1>
          <p className="news-page-p">
            Μιλώντας για την καινοτομία της εργασίας τους σε σχέση με το τι συμβαίνει τόσο στην Ελλάδα όσο και στο εξωτερικό, οι συναρμόδιες
            για την έρευνα αναφέρουν: «Η βιβλιογραφική επισκόπηση που πραγματοποιήσαμε στο πλαίσιο της έρευνάς μας μας δίνει την εικόνα ότι
            δεδομένα για τους νέους συλλέγονται με πρωτοβουλίες κάθε χώρας. Ωστόσο, δεν υπάρχει κάποιο διεθνώς καθιερωμένο εργαλείο συλλογής
            σχετικών δεδομένων. Το ερευνητικό τοπίο, λοιπόν, είναι ρευστό και μάλλον καθορίζεται αφενός από τα ερευνητικά ενδιαφέροντα των
            κοινωνικών επιστημόνων και αφετέρου από τις πηγές-φορείς χρηματοδότησης της έρευνας σε κάθε χώρα.
          </p>
          <p className="news-page-p">
            «Στην Ελλάδα δεν υπάρχει κάποια καθιερωμένη σε βάθος χρόνου έρευνα για τη συγκεκριμένη ηλικιακή ομάδα και από τη βιβλιογραφική
            επισκόπηση εντοπίσαμε ερευνητικό κενό ως προς το συγκεκριμένο θέμα. Σε κάθε περίπτωση δεν εντοπίσαμε καμία έρευνα που να έχει
            αυτά τα σχεδιαστικά χαρακτηριστικά. Θεωρούμε ότι αυτή είναι μια πραγματική καινοτομία!»
          </p>
        </Grid.Row>
        <Grid.Row>
          <h1 className="news-page-h1">Περισσότερες πληροφορίες</h1>
          <p className="news-page-p">
            Η έρευνα <NavLink to="/">YouWho?</NavLink> υλοποιείται από το{' '}
            <a href="https://www.ekke.gr/" target="_blank">
              {' '}
              Εθνικό Κέντρο Κοινωνικών Ερευνών
            </a>
            , υπό την Αιγίδα του Δήμου Αθηναίων, με χρηματοδότηση από το Επιχειρησιακό Πρόγραμμα «Ανταγωνιστικότητα, Επιχειρηματικότητα και
            Καινοτομία» στο πλαίσιο του ΕΣΠΑ 2014-2020, με τη συγχρηματοδότηση της Ελλάδας και της Ευρωπαϊκής Ένωσης (Ευρωπαϊκό Ταμείο
            Περιφερειακής Ανάπτυξης). Για την ανάπτυξη του έργου πραγματοποιείται συνεργασία με το Ινστιτούτο Πληροφοριακών Συστημάτων του{' '}
            <a href="https://www.athena-innovation.gr/" target="_blank">
              Ερευνητικού Κέντρου Αθηνά
            </a>
            .
          </p>
        </Grid.Row>
        <Grid.Row>
          <Image />
          <p className="news-page-p">
            Η έρευνα θα διαρκέσει περίπου μέχρι τα μέσα Απριλίου 2020. Αποτελεί μέρος ενός συνολικού έργου που μελετά τους νέους, το οποίο
            ξεκίνησε το 2017 και διαρκεί τρία χρόνια.
            <br />
            <br />
            <NavLink to="/">Η επίσημη ιστοσελίδα της έρευνας</NavLink>
            <br />
            <br />
            <a href="https://www.facebook.com/YouWho.gr/" target="_blank">
              Η ιστοσελίδα της έρευνας στο Facebook
            </a>
            <br />
            <br />
            <a href="https://www.instagram.com/youwho.gr/" target="_blank">
              H ιστοσελίδα της έρευνας στο Instagram
            </a>
          </p>
        </Grid.Row>
        <div className="news-page-divider" />
        <Grid.Row>
          <p className="news-page-p">Επιμέλεια κειμένου: Μπέττυ Σαβούρδου</p>
        </Grid.Row>
      </Grid>
    </Container>
  </div>
);

export default News2;
