import './project-team.scss';
import React from 'react';
import { connect } from 'react-redux';
import { IRootState } from 'app/shared/reducers';
import { hideSidebar } from 'app/shared/reducers/header';
import { Image, Grid, Responsive } from 'semantic-ui-react';

const MemberBio = (title: string, subtitle: string, description: string, image: string, left: boolean) => (
  <Grid.Row style={{ marginTop: '30px' }}>
    <Grid.Column only="mobile">
      <Image className="project-team-page-image" src={image} circular />
    </Grid.Column>
    {left && (
      <Grid.Column computer={3} only="computer" verticalAlign="middle" style={{ textAlign: 'center', overflow: 'hidden' }}>
        <Image className="project-team-page-image" src={image} />
      </Grid.Column>
    )}
    <Grid.Column width={5} verticalAlign="middle">
      <h1 className="project-team-page-title">{title}</h1>
      <h2 className="project-team-page-subtitle">{subtitle}</h2>
      <p className="project-team-page-description">{description}</p>
    </Grid.Column>
    {!left && (
      <Grid.Column computer={3} only="computer" verticalAlign="middle" style={{ textAlign: 'center', overflow: 'hidden' }}>
        <Image className="project-team-page-image" src={image} />
      </Grid.Column>
    )}
  </Grid.Row>
);

export interface IProjectTeamProps extends StateProps, DispatchProps {}

export class ProjectTeam extends React.Component<IProjectTeamProps> {
  componentDidMount() {
    this.props.hideSidebar();
  }

  render() {
    return (
      <div>
        <Grid className="project-team-page" centered stackable>
          <Grid.Column mobile={5} only="mobile">
            <h1 className="project-team-page-header">Οι Κοινωνικοί Επιστήμονες</h1>
          </Grid.Column>
          <Responsive minWidth={Responsive.onlyTablet.minWidth}>
            <h1 className="project-team-page-header">Οι Κοινωνικοί Επιστήμονες</h1>
          </Responsive>
          {MemberBio(
            'Κατερίνα Ηλιού',
            'Επιστημονική συν-υπεύθυνη έργου (Κοινωνική Ψυχολογία)',
            'Εντεταλμένη Ερευνήτρια στο Εθνικό Κέντρο Κοινωνικών Ερευνών, στο αντικείμενο «Κοινωνική ψυχολογία: Κοινωνικός αποκλεισμός και διακρίσεις». Τα ' +
              'επιστημονικά της ενδιαφέροντα περιλαμβάνουν θέματα όπως προκατάληψη, ρατσισμός, πατριωτισμός, κοινωνική ταυτότητα, ταυτότητα νέων και κλίμακες μέτρησης στάσεων. ' +
              'Έχει συμμετάσχει στην εκπόνηση μελετών πεδίου σε πλαίσιο εθνικών και διεθνών προγραμμάτων και έχει πραγματοποιήσει δημοσιεύσεις και εισηγήσεις σε διεθνή συνέδρια.' +
              ' Είναι επιστημονική συν-υπεύθυνη του έργου.',
            'content/images/project-team/_MG_4402.jpg',
            true
          )}
          {MemberBio(
            'Μανίνα Κακεπάκη',
            'Επιστημονική συν-υπεύθυνη έργου (Πολιτική Επιστήμη)',
            'Εντεταλμένη Ερευνήτρια στο Εθνικό Κέντρο Κοινωνικών Ερευνών, στο αντικείμενο «Πολιτική Κουλτούρα και εκλογική συμπεριφορά». Έχει συμμετάσχει σε πάνω από' +
              ' 30 διεθνή και ελληνικά ερευνητικά προγράμματα ενώ τα τρέχοντα ερευνητικά της ενδιαφέροντα εστιάζονται στις πολιτικές ελίτ και τις ανισότητες στην πολιτική' +
              ' αντιπροσώπευση, στις έμφυλες σχέσεις καθώς και στην μελέτη της ταυτότητας των νέων. Μέσω της πλατφόρμας socioscope έχει εξειδικευθεί στην οπτικοποίηση και ' +
              'διάχυση των ερευνητικών αποτελεσμάτων ενώ διηύθυνε την πρώτη διαδικτυακή έρευνα που υλοποιήθηκε από το ΕΚΚΕ το 2017 με αντικείμενο την ' +
              'συγκριτική μελέτη αξιών σε Ελλάδα και Ουγγαρία.',
            'content/images/project-team/_MG_4451.jpg',
            false
          )}
          {MemberBio(
            'Δήμητρα Κονδύλη',
            'Μέλος ομάδας έργου ΕΚΚΕ (Κοινωνιολογία)',
            'Κύρια Ερευνήτρια στο Εθνικό Κέντρο Κοινωνικών Ερευνών (ΕΚΚΕ) με σημαντική ερευνητική εμπειρία στην υλοποίηση ερευνητικών έργων με αντικείμενο την ' +
              'ανάπτυξη ερευνητικών υποδομών των κοινωνικών επιστημών, καθώς και τη μελέτη της κοινωνίας της πληροφορίας και των επιπτώσεων των νέων τεχνολογιών στην εργασία και ' +
              'την εκπαίδευση με έμφαση στο φύλο. Τα ερευνητικά της ενδιαφέροντα εστιάζουν επίσης σε ζητήματα μεθοδολογίας της εμπειρικής έρευνας (τεκμηρίωση ποσοτικών και ' +
              'ποιοτικών ερευνών, ταξινομητικά σχήματα, θησαυροί όρων, προστασία-διάχυση δεδομένων, ανωνυμοποίηση κ.ά.). Είναι πρόεδρος του Επιστημονικού Συμβουλίου Ινστιτούτου ' +
              '(ΕΣΙ) του ΕΚΚΕ (2019-) και εθνικός εκπρόσωπος της Ελληνικής Ερευνητικής Υποδομής SODaNet στο Service Providers Forum (SPF) του CESSDA ERIC (Consortium of European ' +
              'Social Science Archives).',
            'content/images/project-team/_MG_4539.jpg',
            true
          )}
          {MemberBio(
            'Αμαλία Φραγκίσκου',
            'Μέλος ομάδας έργου ΕΚΚΕ (Επικοινωνία)',
            'Ειδικός Λειτουργικός Επιστήμονας Α’ βαθμίδας στο Εθνικό Κέντρο Κοινωνικών Ερευνών. Σπούδασε Νομικά στο Πανεπιστήμιο Αθηνών και Δημοσιογραφία στο ' +
              'Εργαστήριο Επαγγελματικής Δημοσιογραφίας. Συνέχισε σε μεταπτυχιακές σπουδές στο City University στο Λονδίνο, και απέκτησε τον τίτλο σπουδών ‘Master of Arts in ' +
              'Communications Policy Studies’. Η ερευνητική της δραστηριότητα και το επιστημονικό της ενδιαφέρον εστιάζονται στη πολιτική – κοινωνική - ατομική διάσταση του ' +
              'Επικοινωνιακού Συστήματος (Έντυπα & Ηλεκτρονικά ΜΜΕ, Τηλεπικοινωνίες- Διαδίκτυο) και σε τομείς όπως: Δομές Επικοινωνιών, Ψηφιακή Σύγκλιση, κοινωνικά και ατομικά ' +
              'θέματα της ‘Κοινωνίας των Πληροφοριών’. Ειδικότερα, οι ερευνητικές της προσεγγίσεις μεθοδολογικά αφορούν στις ποιοτικές μεθόδους έρευνας (σημειωτική, ανάλυση ' +
              'περιεχομένου, ανάλυση λόγου, βιογραφικές συνεντεύξεις, ομάδες εστίασης).',
            'content/images/project-team/_MG_4515.jpg',
            false
          )}
          {MemberBio(
            'Κατερίνα Βεζυργιάννη',
            'Επιστημονικός συνεργάτης (Πολιτική Επιστήμη)',
            'Διδάκτωρ του τμήματος Πολιτικής Επιστήμης και Ιστορίας του Παντείου Πανεπιστημίου με αντικείμενο μελέτης τις κοινωνικές διαιρετικές τομές της ύστερης ' +
              'Μεταπολίτευσης (2004-2014). Κάτοχος Msc στην Ευρωπαϊκή Πολιτική και Διακυβέρνηση από το London School of Economics. Έχει εργαστεί ως εξωτερικός συνεργάτης του ΕΚΚΕ ' +
              'στα πλαίσια του έργου «Δυναμική Διαχείριση Βάσεων Κοινωνικών Δεδομένων και Χαρτογραφικών Αναπαραστάσεων - Καλειδοσκόπιο Κοινωνικών Δεδομένων», ως ερευνητής και ' +
              'πολιτικός αναλυτής στον ιδιωτικό τομέα και ως δημοσιογράφος σε εφημερίδες, περιοδικά και ιστοσελίδες. Τα επιστημονικά και ερευνητικά του ενδιαφέροντα αφορούν τη ' +
              'θεωρία των διαιρετικών τομών, την εκλογική συμπεριφορά, τα πολιτικά κόμματα και τα κοινωνικά κινήματα.   ',
            'content/images/project-team/_MG_4510.jpg',
            true
          )}
          {MemberBio(
            'Κωνσταντίνος Πιερίδης',
            'Επιστημονικός συνεργάτης (Πολιτική Επιστήμη)',
            'Διδάκτωρ του τμήματος Πολιτικής Επιστήμης και Ιστορίας του Παντείου Πανεπιστημίου με αντικείμενο μελέτης τις κοινωνικές διαιρετικές τομές της ύστερης ' +
              'Μεταπολίτευσης (2004-2014). Κάτοχος Msc στην Ευρωπαϊκή Πολιτική και Διακυβέρνηση από το London School of Economics. Έχει εργαστεί ως εξωτερικός συνεργάτης του' +
              ' ΕΚΚΕ στα πλαίσια του έργου «Δυναμική Διαχείριση Βάσεων Κοινωνικών Δεδομένων και Χαρτογραφικών Αναπαραστάσεων - Καλειδοσκόπιο Κοινωνικών Δεδομένων», ως ' +
              'ερευνητής και πολιτικός αναλυτής στον ιδιωτικό τομέα και ως δημοσιογράφος σε εφημερίδες, περιοδικά και ιστοσελίδες.' +
              ' Τα επιστημονικά και ερευνητικά του ενδιαφέροντα αφορούν τη θεωρία των διαιρετικών τομών, την εκλογική συμπεριφορά, τα πολιτικά κόμματα και τα κοινωνικά κινήματα.',
            'content/images/project-team/_MG_4484.jpg',
            false
          )}
          {MemberBio(
            'Ειρήνη Κυριαζοπούλου',
            'Επικοινωνιακός σχεδιασμός έργου (Marketing και επικοινωνία)',
            'Επικοινωνιολόγος και Marketer, πτυχιούχος του τμήματος ΕΜΜΕ του Πανεπιστημίου Αθηνών καθώς και κάτοχος MSc in Marketing and Communication από το ' +
              'Οικονομικό Πανεπιστήμιο Αθηνών με εξειδίκευση στο Marketing. Παράλληλα κατέχει το Professional Diploma in Digital & Social Media από το Αμερικάνικο Κολλέγιο ' +
              'Αθηνών. Στην επαγγελματική της εμπειρία συγκαταλέγονται η Εταιρική Επικοινωνία, η δημιουργία και διατήρηση μακροχρόνιων σχέσεων με πελάτες (B2B) και η δημιουργία ' +
              'στρατηγικών εισόδου νέων επιχειρήσεων στην αγορά. Τα επιστημονικά της ενδιαφέροντα αφορούν στο Marketing Υπηρεσιών, τη Συμπεριφορά Καταναλωτή online και offline ' +
              'καθώς και την επίδραση του Servicescape στην ικανοποίηση του καταναλωτή.  Ως μέλος της Ομάδας έργου του YouWho ανέλαβε τον επικοινωνιακό σχεδιασμό και την ' +
              'διαμόρφωση της στρατηγικής καμπάνιας στα social media της έρευνας YouWho.',
            'content/images/project-team/_MG_4431.jpg',
            true
          )}
          <Grid.Column mobile={5} only="mobile">
            <h1 className="project-team-page-header">Πρακτική άσκηση</h1>
          </Grid.Column>
          <Responsive minWidth={Responsive.onlyTablet.minWidth}>
            <h1 className="project-team-page-header" style={{ margin: '50px' }}>
              Πρακτική άσκηση
            </h1>
          </Responsive>
          <Grid.Row>
            <Grid.Column computer={8}>
              <p className="project-team-page-description">
                <span style={{ color: '#ff6666' }}>Διενέργεια έρευνας πεδίου</span>: Νίκος Κληρονόμος, Κατερίνα Πάσχου, Νίκος Σαριδάκης,
                Ιάκωβος Σαχίνης, Ανδρεάς Σιαφάκας.
              </p>
              <p className="project-team-page-description">
                <span style={{ color: '#ff6666' }}>Επεξεργασία δεδομένων</span>: Νικολέτα Γεωργίου, Μαρία Δουρίδα, Συμεών Ιωάννου, Δημήτρης
                Κάστανος, Παναγιώτης Σωπάκης - Βαλαλάκης.
              </p>
              <p className="project-team-page-description">
                <span style={{ color: '#ff6666' }}>Διαχείριση social media</span>: Μάρω Γιαννίκη
              </p>
            </Grid.Column>
          </Grid.Row>
          <Grid.Column mobile={5} only="mobile">
            <h1 className="project-team-page-header">Οι Μηχανικοί Υπολογιστών</h1>
          </Grid.Column>
          <Responsive minWidth={Responsive.onlyTablet.minWidth}>
            <h1 className="project-team-page-header" style={{ margin: '50px' }}>
              Οι Μηχανικοί Υπολογιστών
            </h1>
          </Responsive>
          {MemberBio(
            'Γιώργος Παπαστεφανάτος',
            'Υπεύθυνος σχεδιασμού πλατφόρμας',
            'Διπλωματούχος μηχανικός της Σχολής Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών του Εθνικού Μετσόβιου Πολυτεχνείου (ΕΜΠ). Το 2009 αναγορεύτηκε ' +
              'Διδάκτωρ Μηχανικός στη Σχολή Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών του ΕΜΠ, στην ερευνητική περιοχή των Βάσεων Δεδομένων και Πληροφοριακών Συστημάτων. ' +
              'Από το 2009 είναι ερευνητικός συνεργάτης στο Ινστιτούτο Πληροφοριακών Συστημάτων του Ε.Κ. "Αθηνά". Έχει εργαστεί ως μηχανικός λογισμικού και ερευνητής σε ' +
              'ερευνητικά προγράμματα του ΕΜΠ και του ΕΠΙΣΕΥ. Υπήρξε επιστημονικός υπεύθυνος εκ μέρους του Ε.Κ. ΑΘΗΝΑ στο έργο «Sodamap - Δυναμική διαχείριση βάσεων Κοινωνικών' +
              ' δεδομένων και Χαρτογραφικών αναπαραστάσεων», πρόσκληση “ΚΡΗΠΙΣ” της ΓΓΕΤ όπου σε συνεργασία με το Εθνικό Κέντρο Κοινωνικών Ερευνών υλοποίησαν την πλατφόρμα' +
              ' Καλειδοσκόπιο Κοινωνικών Δεδομένων (www.socioscope.gr).',
            'content/images/project-team/_MG_4560.jpg',
            true
          )}
          {MemberBio(
            'Σταύτος Μαρούλης',
            'Υπεύθυνος τεχνικής ανάπτυξης',
            'Διπλωματούχος μηχανικός και υποψήφιος διδάκτορας της Σχολής Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών του Εθνικού Μετσόβιου Πολυτεχνείου (ΕΜΠ).' +
              ' Από το 2014 είναι ερευνητικός συνεργάτης στο Ινστιτούτο Πληροφοριακών Συστημάτων του Ε.Κ. “Αθηνά” και έχει εργασθεί ως μηχανικός λογισμικού σε πολλά ευρωπαϊκά ' +
              'και ελληνικά ερευνητικά προγράμματα. Συμμετείχε στην ανάπτυξη της πλατφόρμας www.socioscope.gr για την οπτικοποίηση και ανάλυση κοινωνικών και πολιτικών ' +
              'δεδομένων, καθώς και της ψηφιακής πλατφόρμας YouWho για τη συλλογή και διάθεση δεδομένων αποτύπωσης της ταυτότητας των νέων.',
            'content/images/project-team/_MG_4550.jpg',
            false
          )}
          {MemberBio(
            'Χριστίνα Φρέντζου',
            'Μέλος ομάδας έργου ΕΚΚΕ',
            'Πληροφορικός, στέλεχος της Διεύθυνσης Υποστήριξης Ερευνών του ΕΚΚΕ. Θα αναλάβει την τεχνική υποστήριξη των κόμβων socioscope.gr και youwho.gr ' +
              'διασφαλίζοντας την βιωσιμότητα τους και μετά το πέρας του έργου.',
            'content/images/project-team/_MG_4426.jpg',
            true
          )}
          {MemberBio(
            'Αστέρης Γιαννούδης',
            'Πρακτική άσκηση',
            'Απόφοιτος του τμήματος Πληροφορικής και Τηλεπικοινωνιών του Πανεπιστημίου Αθηνών. Έκανε την πρακτική του στο Ερευνητικό Κέντρο Αθηνά με αντικείμενο τη' +
              ' μελέτη, το σχεδιασμό και την ανάπτυξη  μεθόδων επεξεργασίας και ανάλυσης μεγάλων δεδομένων στο Web. Στον ελεύθερο του χρόνο, πέραν του ενδιαφέροντος του στην ' +
              'πληροφορική, ασχολείται με την γυμναστική και τον αθλητισμό, καθώς είναι μέλος της ομάδας καλαθοσφαίρισης με αμαξίδιο της Α.Ε.Κ..',
            'content/images/project-team/_MG_4532.jpg',
            false
          )}
        </Grid>
      </div>
    );
  }
}

const mapStateToProps = (storeState: IRootState) => ({
  isSidebarVisible: storeState.header.isSidebarVisible
});

const mapDispatchToProps = {
  hideSidebar
};

type StateProps = ReturnType<typeof mapStateToProps>;
type DispatchProps = typeof mapDispatchToProps;

export default connect(
  mapStateToProps,
  mapDispatchToProps
)(ProjectTeam);
